lvx/base/InformationRegisters/бит_НастройкиПрограммыОбщие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиПрограммыОбщие</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкиПрограммыУстановлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЗапрещатьИзменятьФайлыВУтвержденныхДокументах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыКонтроляИзмененияФайловВУтвержденныхДокументах</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыСтруктурныхПодразделений</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_НастройкиБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиБюджетирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеФормироватьДвиженияПоФактуАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СценарийОтраженияФактаБДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьЗависимыеОборотыПриАвтоматическомСбореФакта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеФормироватьПроводкиБюджетированияПриАвтоматическомСбореФакта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьФактБДДСНаОснованииОперУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиБюджетированияУстановлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыСтруктурныхПодразделений</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_НастройкиДоговоровИЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиДоговоровИЗатрат</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УстанавливатьВДоговорахВысокийПриоритетЗаполненияАналитик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКонтролироватьЗаявкуНаЗатратыПоБюджету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьНеУчитыватьСверхБюджетныеЗаявкиНаЗатратыПриКонтролеПоБюджету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьГрафикиДоговоровПоБюджету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьПревышенияСуммыПоДоговору</Name>
					<Comment>КонтрольПревышенияСуммыПоДоговору</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиДоговоровИЗатратУстановлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВерсияУдалитьКонтролироватьЗаявкуНаЗатратыПоБюджету</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияУдалитьНеУчитыватьСверхБюджетныеЗаявкиНаЗатратыПриКонтролеПоБюджету</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыСтруктурныхПодразделений</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_НастройкиЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиЗакупок</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормироватьДвиженияПоФактуБюджетаЗакупок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиЗакупокУстановлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьЗависимыеОборотыПоФактуБюджетаЗакупок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьЗаявкуНаЗатратыПоБюджету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчитыватьСверхБюджетныеЗаявкиНаЗатратыПриКонтролеПоБюджету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыСтруктурныхПодразделений</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_НастройкиКазначейства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиКазначейства</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДопустимыйПроцентПревышенияСуммыПрогнозаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьКрайнююДатуПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыКонтроляДатыПлатежа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьЗаявкуПоБюджету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретитьПлатежиБезЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СценарийКонтроляПоБюджету</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиКазначействаУстановлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКонтролироватьОстаткиПоПрогнозуПлатежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопустимыйПроцентПревышенияСуммыПрогнозаПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКонтролироватьОстаткиПоПрогнозуПоступления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьОстаткиПоПрогнозуПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьОстаткиПоПрогнозуПоступления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыСтруктурныхПодразделений</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/CommonForms/бит_НастройкиПрограммы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.КонтекстныйВызов Тогда
		Элементы.Организация.ТолькоПросмотр      = Истина;
		Элементы.Организация.РежимВыбораИзСписка = Ложь;
		Элементы.Организация.КнопкаВыбора        = Ложь;
	КонецЕсли;
	
	ОписатьНастройкиУчета();
	
	Если ЗначениеЗаполнено(Параметры.СтруктурноеПодразделение) Тогда
		Организация = Параметры.СтруктурноеПодразделение;
	КонецЕсли;
	
	ТекущаяДата   = ОбщегоНазначения.ТекущаяДатаПользователя();
	ДатаИзменения = ТекущаяДата;
	
	ПравоРедактированияНастроек =
		ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_НастройкиБюджетирования)
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_НастройкиКазначейства)
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_НастройкиВизирования)
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_НастройкиДоговоровИЗатрат)
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_НастройкиЗакупок)
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_НастройкиПрограммыОбщие);
			
	Если (НЕ ЗначениеЗаполнено(Организация) И Организация <> Неопределено) ИЛИ Параметры.РежимНастройки Тогда
		УстановитьДоступностьВидимостьНастроек(Ложь);
		Если НЕ ЗначениеЗаполнено(Организация) И ПравоРедактированияНастроек Тогда
			СоздатьСсылкиДляСущестующихНастроек();		
		КонецЕсли;
	Иначе
		ПодготовитьФормуНастройкиСписка();
		ПодготовитьФормуНаСервере();
	КонецЕсли;
			
	Если ЗначениеЗаполнено(Параметры.ТекущаяЗакладка) Тогда
		НайденныеЗакладки = Список.НайтиСтроки(Новый Структура("Идентификатор", Параметры.ТекущаяЗакладка));
		Если НайденныеЗакладки.Количество() <> 0 Тогда
			Элементы.Список.ТекущаяСтрока = НайденныеЗакладки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПодсказкуВводаОрганизации(ЭтотОбъект, Истина);
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Организация) И Организация <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОрганизацияНедоступна Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(РезультатБлокировки) Тогда
		ПоказатьПредупреждение( , РезультатБлокировки);
		РезультатБлокировки = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И ЗавершениеРаботы Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьНастройкиБюджетирования"
		ИЛИ ИмяСобытия = "ЗаписьНастройкиКазначейства"
		ИЛИ ИмяСобытия = "ЗаписьНастройкиВизирования"
		ИЛИ ИмяСобытия = "ЗаписьНастройкиДоговоровИЗатрат"
		ИЛИ ИмяСобытия = "ЗаписьНастройкиЗакупок"
		ИЛИ ИмяСобытия = "ЗаписьНастройкиПрограммыОбщие" Тогда
		
		ИмяРаздела = СтрЗаменить(ИмяСобытия, "Запись","");
		Если Параметр.Свойство("СтруктурноеПодразделение") Тогда
			Если Параметр.СтруктурноеПодразделение <> Организация Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Если Параметр.Свойство("Период") Тогда
			Если Параметр.Период < ЭтотОбъект[ИмяРаздела].Период
				Или (Параметр.Период > ЭтотОбъект[ИмяРаздела].Период
					И Параметр.Период >= ТекущаяДата) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ПеречитатьНастройкиНаТекущуюДату(ИмяРаздела);
		
	ИначеЕсли ИмяСобытия = "Запись_Организации" Тогда
		
		// При записи новой организации необходимо добавить ее в список доступных организаций.
		ОбработкаОповещенияЗаписьОрганизации(Параметр, Источник);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив; 
	
	Если Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.Страница_НастройкиБюджетирования Тогда
		ОтражатьФакт = НЕ НастройкиБюджетирования.НеФормироватьДвиженияПоФактуАвтоматически;
		Если ОтражатьФакт И НЕ ЗначениеЗаполнено(НастройкиБюджетирования.СценарийОтраженияФактаБДДС) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , 
								НСтр("ru = 'Сценарий отражения факта по бюджету'; 
								|en = 'Scenario for reflecting actual budget data'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , 
					"НастройкиБюджетирования.СценарийОтраженияФактаБДДС", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Организация = Неопределено Тогда
		НепроверяемыеРеквизиты.Добавить("Организация");	
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаИзмененияНастроекОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Истина;
	
	Если Организация = Неопределено Тогда
		
		МенюОрганизации = Новый СписокЗначений; 
		МенюОрганизации.Добавить(1, НСтр("ru = 'Организации'"));
		МенюОрганизации.Добавить(2, НСтр("ru = 'ЦФО'"));
		МенюОрганизации.Добавить(3, НСтр("ru = 'Группы структурных подразделений'"));
		
		ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ОрганизацияНачалоВыбораЗавершение", ЭтотОбъект),
			МенюОрганизации, Элементы.Организация);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = 1 Тогда
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ИначеЕсли ВыбранныйЭлемент.Значение = 2 Тогда
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.Подразделения");
	ИначеЕсли ВыбранныйЭлемент.Значение = 3 Тогда
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.бит_ГруппыСтруктурныхПодразделений");	
	Иначе
		ОписаниеТипов = Новый ОписаниеТипов;
	КонецЕсли;
	
	Организация = ОписаниеТипов.ПривестиЗначение(Организация);
	Элементы.Организация.ОграничениеТипа = ОписаниеТипов;
	УстановитьПодсказкуВводаОрганизации(ЭтотОбъект);
	
	УстановитьДоступностьВидимостьНастроек(Истина);
	Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницыНастроекОжидание;
	УстановитьДоступностьСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Организация = Неопределено;
	Элементы.Организация.ОграничениеТипа = Новый ОписаниеТипов;
	УстановитьПодсказкуВводаОрганизации(ЭтотОбъект);
	
	// Организация сбрасывается в "неопределено". Читаем настройки "для всего предприятия".
	ПриИзмененииОрганизации();
	
КонецПроцедуры

#Область Бюджетирование
	
&НаКлиенте
Процедура НеФормироватьДвиженияПоФактуАвтоматическиПриИзменении(Элемент)
	
	ОтражатьФакт = НЕ НастройкиБюджетирования.НеФормироватьДвиженияПоФактуАвтоматически;
	Если НЕ ОтражатьФакт Тогда
		НастройкиБюджетирования.НеФормироватьПроводкиБюджетированияПриАвтоматическомСбореФакта = Истина;
		НастройкиБюджетирования.ФормироватьЗависимыеОборотыПриАвтоматическомСбореФакта		  = Ложь;
		НастройкиБюджетирования.ОтражатьФактБДДСНаОснованииОперУчета						   = Ложь;
	КонецЕсли;

	УправлениеФормой(ЭтотОбъект, "НастройкиБюджетирования");
	ОтобразитьПериоды("НастройкиБюджетирования");
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийОтраженияФактаБДДСПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиБюджетирования");
	
КонецПроцедуры

&НаКлиенте
Процедура НеФормироватьПроводкиБюджетированияПриАвтоматическомСбореФактаПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиБюджетирования");
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьЗависимыеОборотыПриАвтоматическомСбореФактаПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиБюджетирования");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтражатьФактБДДСНаОснованииОперУчетаПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиБюджетирования");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиБюджетированияНеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджетуПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиБюджетирования");

КонецПроцедуры

#КонецОбласти 

#Область Казначейство

&НаКлиенте
Процедура КонтролироватьОстаткиПоПрогнозуПлатежаПриИзменении(Элемент)
	
	НеКонтролировать = ПредопределенноеЗначение("Перечисление.бит_ВидыКонтроля.НеКонтролировать");
	
	Если НастройкиКазначейства.КонтролироватьОстаткиПоПрогнозуПлатежа = НеКонтролировать Тогда
		НастройкиКазначейства.ДопустимыйПроцентПревышенияСуммыПрогнозаПлатежа = 0;
	КонецЕсли; 
	
	УправлениеФормой(ЭтотОбъект, "НастройкиКазначейства");
	ОтобразитьПериоды("НастройкиКазначейства");
	
КонецПроцедуры

&НаКлиенте
Процедура ДопустимыйПроцентПревышенияСуммыПрогнозаПлатежаПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиКазначейства");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьЗаявкуПоБюджетуПриИзменении(Элемент)
	
	Если НЕ НастройкиКазначейства.КонтролироватьЗаявкуПоБюджету Тогда
		НастройкиКазначейства.НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету = Истина;
	КонецЕсли; 
	
	УправлениеФормой(ЭтотОбъект, "НастройкиКазначейства");
	ОтобразитьПериоды("НастройкиКазначейства");
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийКонтроляПоБюджетуПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиКазначейства");
	
КонецПроцедуры

&НаКлиенте
Процедура НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджетуПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиКазначейства");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьКрайнююДатуПлатежаПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиКазначейства");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьПлатежиБезЗаявкиПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиКазначейства");
	
КонецПроцедуры

&НаКлиенте
Процедура ДопустимыйПроцентПревышенияСуммыПрогнозаПоступленияПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиКазначейства");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьОстаткиПоПрогнозуПоступленияПриИзменении(Элемент)
	
	НеКонтролировать = ПредопределенноеЗначение("Перечисление.бит_ВидыКонтроля.НеКонтролировать");
	
	Если НастройкиКазначейства.КонтролироватьОстаткиПоПрогнозуПоступления = НеКонтролировать Тогда
		НастройкиКазначейства.ДопустимыйПроцентПревышенияСуммыПрогнозаПоступления = 0;
	КонецЕсли;                   
	
	УправлениеФормой(ЭтотОбъект);
	ОтобразитьПериоды("НастройкиКазначейства");
	
КонецПроцедуры

#КонецОбласти 

#Область Визирование

&НаКлиенте
Процедура ИспользоватьКалендарьДляРасчетаКрайнейДатыПриИзменении(Элемент)
	
	Если НЕ НастройкиВизирования.ИспользоватьКалендарьДляРасчетаКрайнейДаты Тогда
		ВизированиеУчитыватьРасписаниеПредприятия        = Ложь;
		НастройкиВизирования.НачалоРабочегоДня 	         = '0001-01-01';
		НастройкиВизирования.ОкончаниеРабочегоДня        = '0001-01-01';
		НастройкиВизирования.УчитыватьПредпраздничныеДни = Ложь;
		ВизированиеУчитыватьОбеденныйПерерыв             = Ложь;
		НастройкиВизирования.НачалоОбеденногоПерерыва    = '0001-01-01'; 
		НастройкиВизирования.ОкончаниеОбеденногоПерерыва = '0001-01-01';
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект, "НастройкиВизирования");
	ОтобразитьПериоды("НастройкиВизирования");
	
КонецПроцедуры

&НаКлиенте
Процедура ВизированиеУчитыватьРассписаниеПредприятияПриИзменении(Элемент)
	
	Если НЕ ВизированиеУчитыватьРасписаниеПредприятия Тогда
		НастройкиВизирования.НачалоРабочегоДня 	  = '0001-01-01';
		НастройкиВизирования.ОкончаниеРабочегоДня = '0001-01-01';
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект, "НастройкиВизирования");
	ОтобразитьПериоды("НастройкиВизирования");
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоРабочегоДняПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиВизирования");
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРабочегоДняПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиВизирования");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВизированияУчитыватьПредпраздничныеДниПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиВизирования");
	
КонецПроцедуры

&НаКлиенте
Процедура ВизированиеУчитыватьОбеденныйПерерывПриИзменении(Элемент)
	
	Если НЕ ВизированиеУчитыватьОбеденныйПерерыв Тогда
		НастройкиВизирования.НачалоОбеденногоПерерыва    = '0001-01-01';
		НастройкиВизирования.ОкончаниеОбеденногоПерерыва = '0001-01-01';
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект, "НастройкиВизирования");
	ОтобразитьПериоды("НастройкиВизирования");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВизированияНачалоОбеденногоПерерываПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(НастройкиВизирования.НачалоОбеденногоПерерыва) Тогда
		ЧасВСекундах = 3600;
		НастройкиВизирования.ОкончаниеОбеденногоПерерыва = НастройкиВизирования.НачалоОбеденногоПерерыва + ЧасВСекундах;
	КонецЕсли;
	
	ОтобразитьПериоды("НастройкиВизирования");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВизированияОкончаниеОбеденногоПерерываПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиВизирования");
	
КонецПроцедуры
 
#КонецОбласти

#Область НастройкиДоговоровИЗакупок

&НаКлиенте
Процедура УстанавливатьВДоговорахВысокийПриоритетЗаполненияАналитикПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиДоговоровИЗатрат");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьГрафикиДоговоровПоБюджетуПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиДоговоровИЗатрат");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьЗаявкуНаЗатратыПоБюджетуПриИзменении(Элемент)
	
	Если НЕ НастройкиЗакупок.КонтролироватьЗаявкуНаЗатратыПоБюджету Тогда
		НастройкиЗакупок.НеУчитыватьСверхБюджетныеЗаявкиНаЗатратыПриКонтролеПоБюджету = Истина;	
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект, "НастройкиЗакупок");
	ОтобразитьПериоды("НастройкиЗакупок");
	
КонецПроцедуры

&НаКлиенте
Процедура НеУчитыватьСверхБюджетныеЗаявкиНаЗатратыПриКонтролеПоБюджетуПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиЗакупок");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьПревышенияСуммыПоДоговоруПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиДоговоровИЗатрат");
	
КонецПроцедуры

#КонецОбласти 

#Область Закупки

&НаКлиенте
Процедура ФормироватьДвиженияПоФактуБюджетаЗакупокПриИзменении(Элемент)
	
	Если НЕ НастройкиЗакупок.ФормироватьДвиженияПоФактуБюджетаЗакупок Тогда
		НастройкиЗакупок.ФормироватьЗависимыеОборотыПоФактуБюджетаЗакупок 		= Ложь;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект, "НастройкиЗакупок");
	ОтобразитьПериоды("НастройкиЗакупок");
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьЗависимыеОборотыПоФактуБюджетаЗакупокПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиЗакупок");
	
КонецПроцедуры

#КонецОбласти 

#Область ОбщиеНастройки

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	
	ОтобразитьПериоды("НастройкиПрограммыОбщие");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ЗначениеЗаполнено(Организация) ИЛИ Организация = Неопределено Тогда
		ПриАктивизацииСтрокиСписка();
	КонецЕсли;
	
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ТекущийЭлемент.Имя, "ОК_") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРаздела = ИмяРаздела(ТекущийЭлемент.Имя);
	
	ЗаписатьИзменения(ИмяРаздела);
	ОповеститьОбИзмененииНастроек();
	ОтобразитьИсторию(ИмяРаздела);
		
	Активизировать();
	
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	
	Если НЕ ЗначениеЗаполнено(Организация) И Организация <> Неопределено Тогда
		Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
			Поле = НСтр("ru = 'Организация'");
		ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Подразделения") Тогда	
			Поле = НСтр("ru = 'ЦФО'");
		ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.бит_ГруппыСтруктурныхПодразделений") Тогда
			Поле = НСтр("ru = 'Группа структурных подразделений'");
		КонецЕсли;
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,Поле);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Организация");
		Возврат;
	КонецЕсли;
	
	ИмяРегистра = "бит_" + ИмяРаздела(ТекущийЭлемент.Имя);
	Отбор = Новый Структура("СтруктурноеПодразделение", Организация);
	
	ОткрытьФорму(СтрШаблон("РегистрСведений.%1.ФормаСписка", ИмяРегистра), 
		Новый Структура("Отбор", Отбор));
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Если СтрНайти(ТекущийЭлемент.Имя, "Отменить_") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРаздела = ИмяРаздела(ТекущийЭлемент.Имя);
	Элементы["Страницы" + ИмяРаздела + "История"].ТекущаяСтраница = Элементы["Страница" + ИмяРаздела + "Периоды"];
	
	Модифицированность = Ложь;
	УстановитьДоступностьСписка();
	
	ПеречитатьНастройкиНаТекущуюДату(ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура ДляВсегоПредприятия(Команда)
	
	ПриИзмененииОрганизации();
	УстановитьПодсказкуВводаОрганизации(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПоУмолчанию(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДатаИзменения) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Период'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ДатаИзменения");
		Возврат;
	КонецЕсли;
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ИмяРаздела	  = ТекущиеДанные.Идентификатор;

	ПрочитатьОтдельнуюНастройкуУчетнойПолитики(ИмяРаздела, ДатаИзменения, Истина);
	ПриАктивизацииСтрокиСписка();
		
КонецПроцедуры

&НаКлиенте
Процедура ДействующиеНастройки(Команда)
	
	Если НЕ ЗначениеЗаполнено(Организация) И Организация <> Неопределено Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ" , 
								"Заполнение", НСтр("ru = 'Подразделение'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Подразделение"); 
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("КлючВарианта", "НастройкиПрограммы");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	Если Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаНастройки Тогда
		Отборы  = Новый Структура("СтруктурноеПодразделение", Организация); 
		ПараметрыФормы.Вставить("Отбор", Отборы);
	КонецЕсли;
	
	ОткрытьФорму("Отчет.бит_НастройкиПрограммы.Форма", ПараметрыФормы, , ЭтотОбъект); 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПоказатьНастройкиВыбранногоПодразделения(Команда)

	РезультатПоиска = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КомандыПоПодразделениям, Команда.Имя, 0);
	Если РезультатПоиска <> 0 Тогда
		Организация = РезультатПоиска;
		ПриИзмененииОрганизации();
		УстановитьПодсказкуВводаОрганизации(ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьНастройки(Команда)
	
	ТекстВопроса = НСтр("ru = 'Будет удалена история изменений во всех разделах настройки программы для текущего подразделения. Продолжить?'; 
					|en = 'The history of changes in all sections of the program settings for the current department will be deleted. Continue?'");
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьНастройкиНаСервере();
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЧтениеНастроекУчета

&НаСервере
Процедура ПрочитатьУчетнуюПолитику()
	
	МенеджерЗаписиПериодическогоРегистра("НастройкиПрограммыОбщие", Организация);
	МенеджерЗаписиПериодическогоРегистра("НастройкиБюджетирования", Организация);
	МенеджерЗаписиПериодическогоРегистра("НастройкиКазначейства", Организация);
	МенеджерЗаписиПериодическогоРегистра("НастройкиВизирования", Организация);
	ПриЧтенииНастроекВизирования();
	МенеджерЗаписиПериодическогоРегистра("НастройкиДоговоровИЗатрат", Организация);
	МенеджерЗаписиПериодическогоРегистра("НастройкиЗакупок", Организация);
		
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНастройкиОрганизации()
	 
	ПрочитатьНастройкиОрганизацииНаСервере();
	
	Если Не ПустаяСтрока(РезультатБлокировки) Тогда
		ПоказатьПредупреждение( , РезультатБлокировки);
		РезультатБлокировки = "";
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Процедура ОписатьНастройкиУчета()
	
	Список.Очистить();
	
	СкрытыеОтчеты = 0;
	
	// ++ ЕРП: нет подходящих картинок.
	
	НоваяСтрока = Список.Добавить();
	НоваяСтрока.Наименование  = НСтр("ru = 'Общие'");
	НоваяСтрока.Идентификатор = "НастройкиПрограммыОбщие";
	
	НоваяСтрока = Список.Добавить();
	НоваяСтрока.Наименование  = НСтр("ru = 'Бюджетирование'");
	НоваяСтрока.Идентификатор = "НастройкиБюджетирования";
	
	НоваяСтрока = Список.Добавить();
	НоваяСтрока.Наименование  = НСтр("ru = 'Казначейство'");
	НоваяСтрока.Идентификатор = "НастройкиКазначейства";
	
	НоваяСтрока = Список.Добавить();
	НоваяСтрока.Наименование  = НСтр("ru = 'Визирование'");
	НоваяСтрока.Идентификатор = "НастройкиВизирования";
		
	НоваяСтрока = Список.Добавить();
	НоваяСтрока.Наименование  = НСтр("ru = 'Договоры'");
	НоваяСтрока.Идентификатор = "НастройкиДоговоровИЗатрат";
	
	НоваяСтрока = Список.Добавить();
	НоваяСтрока.Наименование  = НСтр("ru = 'Закупки'");
	НоваяСтрока.Идентификатор = "НастройкиЗакупок";
		
КонецПроцедуры

&НаСервере
Процедура ПрочитатьОтдельнуюНастройкуУчетнойПолитики(Знач ИмяРаздела, Знач ПериодЗначений, Знач Создать = Ложь)
	
	ОтборОрганизация = Новый Структура("Организация",Организация);
	
	МенеджерЗаписиПериодическогоРегистра(ИмяРаздела, Организация,, ПериодЗначений, Создать);
	
КонецПроцедуры

&НаСервере
Процедура МенеджерЗаписиПериодическогоРегистра(ИмяРаздела, ЗначениеОтбора, ИмяОтбора = "СтруктурноеПодразделение", 
			ПериодЗначений = Неопределено, Создавать = Ложь)
	
	Если ПериодЗначений = Неопределено Тогда
		ПериодЗначений = ТекущаяДата;
	КонецЕсли;
	
	ИмяРегистра = СтрШаблон("бит_%1",   ИмяРаздела);
	ИмяФлага 	= ИмяФлагаНастройкаВыбрана(ИмяРаздела);
	
	КлючЗаписи = бит_НастройкиПрограммы.КлючЗаписиДействующейУчетнойПолитики(ИмяРегистра, ЗначениеОтбора, ПериодЗначений);
	Если КлючЗаписи = Неопределено Тогда
		
		Если НЕ ПравоРедактированияНастроек Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ Создавать Тогда
			ЭтотОбъект[ИмяФлага] = Ложь;
			Возврат;
		КонецЕсли;
		
		ДанныеЗаполнения = Новый Структура("Период, " + ИмяОтбора, ПериодЗначений, ЗначениеОтбора); 

		МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
		РегистрыСведений[ИмяРегистра].УстановкаНастроекПоУмолчанию(МенеджерЗаписи, ДанныеЗаполнения);
		МенеджерЗаписи.Записать(Истина);
	Иначе
		МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
		МенеджерЗаписи[ИмяОтбора] = КлючЗаписи[ИмяОтбора];
		МенеджерЗаписи.Период     = КлючЗаписи.Период;
		МенеджерЗаписи.Прочитать();
	КонецЕсли;
	
	ЭтотОбъект[ИмяФлага] = Истина;
	ЗначениеВРеквизитФормы(МенеджерЗаписи, ИмяРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНастроекВизирования()
	
	ВизированиеУчитыватьРасписаниеПредприятия = ЗначениеЗаполнено(НастройкиВизирования.НачалоРабочегоДня)
													ИЛИ ЗначениеЗаполнено(НастройкиВизирования.ОкончаниеРабочегоДня);
	ВизированиеУчитыватьОбеденныйПерерыв      = ЗначениеЗаполнено(НастройкиВизирования.НачалоОбеденногоПерерыва)
													ИЛИ ЗначениеЗаполнено(НастройкиВизирования.ОкончаниеОбеденногоПерерыва);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНастройкиСписка()
	
	Модифицированность = Ложь;
	
	Если Не ЗначениеЗаполнено(Организация) И Организация <> Неопределено Тогда
		Элементы.Список.ТолькоПросмотр            = Истина;
		Элементы.СписокПодчиненный.ТолькоПросмотр = Истина;
		Элементы.СтраницыНастроек.ТолькоПросмотр  = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ПравоРедактированияНастроек Тогда
		Элементы.СтраницыНастроек.ТолькоПросмотр  = Истина;
		Элементы.СписокПодчиненный.ТолькоПросмотр = Истина;
	Иначе
	
		Элементы.Список.ТолькоПросмотр            = Ложь;
		Элементы.СтраницыНастроек.ТолькоПросмотр  = Ложь;
		
		// Так как изменяем данные разных записей в одной форме, 
		// то наложим пессимистическую объектную блокировку вручную - 
		// по специальному набору измерений, который никогда не будет записан в регистр.
		
		РезультатБлокировки = "";
		Попытка 
			ОписаниеКлюча = Новый Структура("СтруктурноеПодразделение", Организация); 
			ЗаблокироватьДанныеДляРедактирования(
				РегистрыСведений.бит_НастройкиПрограммыОбщие.СоздатьКлючЗаписи(ОписаниеКлюча),
				, // Данные не хранятся в ИБ
				УникальныйИдентификатор); 
		Исключение
			Элементы.СтраницыНастроек.ТолькоПросмотр = Истина;
			РезультатБлокировки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьНастройкиНаТекущуюДату(Знач ИмяРаздела)
	
	ПрочитатьОтдельнуюНастройкуУчетнойПолитики(ИмяРаздела, ТекущаяДата);
	УправлениеФормой(ЭтотОбъект, ИмяРаздела);
	
КонецПроцедуры

#КонецОбласти 

#Область СохранениеРезультатовРаботы

&НаСервере
Процедура ЗаписатьИзменения(Знач ИмяРаздела)
	
	Если ДатаИзменения = ЭтотОбъект[ИмяРаздела].Период Тогда
		МенеджерЗаписи = РеквизитФормыВЗначение(ИмяРаздела);
	Иначе
		ИмяРегистра = "бит_" + ИмяРаздела;
		МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЭтотОбъект[ИмяРаздела],,"Период");
		МенеджерЗаписи.Период = ДатаИзменения;
	КонецЕсли;
	МенеджерЗаписи.Записать(Истина);
	
	Модифицированность = Ложь;
	
	ПеречитатьНастройкиНаТекущуюДату(ИмяРаздела);
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ВопросСохранитьИзменения()
	
	ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?';
					|en = 'The data was changed. Save changes?'");
	Оповещение = Новый ОписаниеОповещения("ВопросПередСменойОрганизации", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ВопросПередСменойОрганизации(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницыНастроекОжидание;
		ПрочитатьНастройкиОрганизации();
		УстановитьДоступностьСписка();
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
			ИмяРаздела = Элементы.Список.ТекущиеДанные.Идентификатор;
			ЗаписатьИзмененияРазделаНаКлиенте(ИмяРаздела);
		КонецЕсли;
		
		ОповеститьОбИзмененииНастроек();
		Модифицированность = Ложь;
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницыНастроекОжидание;
		ПрочитатьНастройкиОрганизации();
		УстановитьДоступностьСписка();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = Ложь;
		Закрыть();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
			ИмяРаздела = Элементы.Список.ТекущиеДанные.Идентификатор;
			ЗаписатьИзмененияРазделаНаКлиенте(ИмяРаздела);
		КонецЕсли;
		
		Модифицированность = Ложь;
		ОповеститьОбИзмененииНастроек();
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияРазделаНаКлиенте(ИмяРаздела)

	ЗаписатьИзменения(ИмяРаздела);

КонецПроцедуры

#КонецОбласти

#Область ОтрисовкаФормы

&НаСервере
Процедура УстановитьДоступностьВидимостьНастроек(Знач ДоступностьВидимость)
	
	Если ОрганизацияНедоступна Тогда
		Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаНедоступная;
	Иначе
		Если ДоступностьВидимость Тогда
			Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаНастройки;
		Иначе
			Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаПустая;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.УдалитьНастройки.Видимость = (Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(ЗаполнитьПоУмолчанию = Ложь)
	
	ПрочитатьИОписатьНастройкиУчета();
		
	СброситьСтраницыИсторииИзменений();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма, ИмяРаздела = Неопределено)
	
	Если ИмяРаздела = Неопределено ИЛИ ИмяРаздела = "НастройкиБюджетирования" Тогда
		бит_НастройкиПрограммыКлиентСервер.НастройкиБюджетированияУправлениеФормой(Форма);
	КонецЕсли;
	
	Если ИмяРаздела = Неопределено ИЛИ ИмяРаздела = "НастройкиКазначейства" Тогда
		бит_НастройкиПрограммыКлиентСервер.НастройкиКазначействаУправлениеФормой(Форма);
	КонецЕсли;
	
	Если ИмяРаздела = Неопределено ИЛИ ИмяРаздела = "НастройкиВизирования" Тогда
		бит_НастройкиПрограммыКлиентСервер.НастройкиВизированияУправлениеФормой(Форма);
	КонецЕсли;
	
	Если ИмяРаздела = Неопределено ИЛИ ИмяРаздела = "НастройкиЗакупок" Тогда
		бит_НастройкиПрограммыКлиентСервер.НастройкиЗакупокУправлениеФормой(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПериоды(ИмяРаздела)
	
	Элементы["Страницы" + ИмяРаздела + "История"].ТекущаяСтраница = Элементы["Страница" + ИмяРаздела + "Изменение"];
	
	УстановитьДоступностьСписка();
	
	УправлениеФормой(ЭтотОбъект, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьИсторию(ИмяРаздела)
	
	Элементы["Страницы" + ИмяРаздела + "История"].ТекущаяСтраница = Элементы["Страница" + ИмяРаздела + "Периоды"];
	
	Модифицированность = Ложь;
	УстановитьДоступностьСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьСписка()
	
	Элементы.Список.Доступность = НЕ Модифицированность;
	
	ОрганизацияВыбрана = ЗначениеЗаполнено(Организация) ИЛИ Организация = Неопределено;
	
	Если НЕ Модифицированность И ОрганизацияВыбрана Тогда
		ПриАктивизацииСтрокиСписка();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СброситьСтраницыИсторииИзменений()
	
	Элементы.СтраницыНастройкиБюджетированияИстория.ТекущаяСтраница   = Элементы.СтраницаНастройкиБюджетированияПериоды;
	Элементы.СтраницыНастройкиВизированияИстория.ТекущаяСтраница      = Элементы.СтраницаНастройкиВизированияПериоды;
	Элементы.СтраницыНастройкиДоговоровИЗатратИстория.ТекущаяСтраница = Элементы.СтраницаНастройкиДоговоровИЗатратПериоды;
	Элементы.СтраницыНастройкиЗакупокИстория.ТекущаяСтраница          = Элементы.СтраницаНастройкиЗакупокПериоды;
	Элементы.СтраницыНастройкиКазначействаИстория.ТекущаяСтраница     = Элементы.СтраницаНастройкиКазначействаПериоды;
	Элементы.СтраницыНастройкиПрограммыОбщиеИстория.ТекущаяСтраница   = Элементы.СтраницаНастройкиПрограммыОбщиеПериоды;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСсылкиДляСущестующихНастроек()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Надпись", НСтр("ru = '<Для всего предприятия>'"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_НастройкиБюджетирования.СтруктурноеПодразделение КАК СтруктурноеПодразделение
	|ПОМЕСТИТЬ ВсеСтруктурныеПодразделения
	|ИЗ
	|	РегистрСведений.бит_НастройкиБюджетирования КАК бит_НастройкиБюджетирования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НастройкиВизирования.СтруктурноеПодразделение
	|ИЗ
	|	РегистрСведений.бит_НастройкиВизирования КАК бит_НастройкиВизирования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НастройкиДоговоровИЗатрат.СтруктурноеПодразделение
	|ИЗ
	|	РегистрСведений.бит_НастройкиДоговоровИЗатрат КАК бит_НастройкиДоговоровИЗатрат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НастройкиЗакупок.СтруктурноеПодразделение
	|ИЗ
	|	РегистрСведений.бит_НастройкиЗакупок КАК бит_НастройкиЗакупок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НастройкиКазначейства.СтруктурноеПодразделение
	|ИЗ
	|	РегистрСведений.бит_НастройкиКазначейства КАК бит_НастройкиКазначейства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НастройкиПрограммыОбщие.СтруктурноеПодразделение
	|ИЗ
	|	РегистрСведений.бит_НастройкиПрограммыОбщие КАК бит_НастройкиПрограммыОбщие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеСтруктурныеПодразделения.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ВЫБОР
	|		КОГДА ВсеСтруктурныеПодразделения.СтруктурноеПодразделение <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ВсеСтруктурныеПодразделения.СтруктурноеПодразделение)
	|		ИНАЧЕ &Надпись
	|	КОНЕЦ КАК СтруктурноеПодразделениеПредставление,
	|	ВсеСтруктурныеПодразделения.СтруктурноеПодразделение <> НЕОПРЕДЕЛЕНО КАК ПорядокЭлементов
	|ИЗ
	|	ВсеСтруктурныеПодразделения КАК ВсеСтруктурныеПодразделения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокЭлементов,
	|	СтруктурноеПодразделениеПредставление";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	КлючиКоманд = Новый Структура;

	Пока Выборка.Следующий() Цикл
		ИмяКоманды = "ПоказатьНастройки_" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
		КлючиКоманд.Вставить(ИмяКоманды, Выборка.СтруктурноеПодразделение);
		
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие  = "Подключаемый_ПоказатьНастройкиВыбранногоПодразделения";
		НоваяКоманда.Заголовок = Выборка.СтруктурноеПодразделениеПредставление;
		
		НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ГруппаНайденныеНастройкиПустойСтраницы);
		НовыйЭлемент.Вид 		= ВидКнопкиФормы.Гиперссылка;
		НовыйЭлемент.ИмяКоманды = НоваяКоманда.Имя;
		
		Если Выборка.СтруктурноеПодразделение = Неопределено Тогда
			Элементы.ДляВсегоПредприятия.Видимость = Ложь;	
		КонецЕсли;
	КонецЦикла;
	
	КомандыПоПодразделениям = Новый ФиксированнаяСтруктура(КлючиКоманд);
	
КонецПроцедуры
 
#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура ПриАктивизацииСтрокиСписка()
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Идентификатор = ТекущиеДанные.Идентификатор;
	ИмяСтраницы   = СтрШаблон("Страница_%1", Идентификатор);
	ИмяФлага 	  = ИмяФлагаНастройкаВыбрана(Идентификатор);
	
	Если ЭтотОбъект[ИмяФлага] Тогда
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы[ИмяСтраницы];
	Иначе	
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницаНеНайдено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	// АПК:277-выкл Поставщик библиотеки не разбил модуль на области.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СценарийОтраженияФактаБДДС");
	// АПК:277-вкл
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"НастройкиБюджетирования.НеФормироватьДвиженияПоФактуАвтоматически", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	// АПК:277-выкл Поставщик библиотеки не разбил модуль на области.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Организация");
	// АПК:277-вкл
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Организация", ВидСравненияКомпоновкиДанных.Равно, Неопределено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииНастроек()
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.бит_НастройкиБюджетирования"));
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.бит_НастройкиВизирования"));
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.бит_НастройкиДоговоровИЗатрат"));
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.бит_НастройкиЗакупок"));
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.бит_НастройкиКазначейства"));
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.бит_НастройкиПрограммыОбщие"));
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНастройки()
	
	Модифицированность = Ложь;
	
	Если Не ЗначениеЗаполнено(Организация) И Организация <> Неопределено Тогда
		Элементы.Список.ТолькоПросмотр = Истина;
		Элементы.СтраницыНастроек.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ПравоРедактированияНастроек Тогда
		Элементы.СтраницыНастроек.ТолькоПросмотр = Истина;
	Иначе
	
		Элементы.СтраницыНастроек.ТолькоПросмотр = Ложь;
		
		// Так как изменяем данные разных записей в одной форме, 
		// то наложим пессимистическую объектную блокировку вручную - 
		// по специальному набору измерений, который никогда не будет записан в регистр.
		
		КлючЗаписи = бит_НастройкиПрограммы.КлючЗаписиДействующейУчетнойПолитики("бит_НастройкиБюджетирования", 
						Справочники.Организации.ПустаяСсылка(), ТекущаяДатаСеанса());
		Если КлючЗаписи <> Неопределено Тогда
			
			РезультатБлокировки = "";
			Попытка 
				ЗаблокироватьДанныеДляРедактирования(
					КлючЗаписи,
					, // Данные не хранятся в ИБ
					УникальныйИдентификатор); // На все время жизни формы
			Исключение
				Элементы.СтраницыНастроек.ТолькоПросмотр = Истина;
				РезультатБлокировки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Вызывается при получении оповещения о записи организации.
// Для новых организаций добавляет их ссылки в отбор параметра выбора, 
// чтобы они были доступны в списке на форме.
//
// Параметры:
//	Параметр - Неопределено, Структура - Параметр, полученный в ОбработкаОповещения().
//		Если имеет тип Структура и содержит ключ "ЭтоНовый", то такое оповещения будет обработано,
//		иначе проигнорировано.
//	Источник - СправочникСсылка.Организации - Ссылка на измененную организацию.
//
Процедура ОбработкаОповещенияЗаписьОрганизации(Параметр, Источник)
	
	Если ТипЗнч(Параметр) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметр.Свойство("ЭтоНовый") 
		ИЛИ НЕ Параметр.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОрганизации()

	Если Модифицированность Тогда
		ВопросСохранитьИзменения();
	Иначе
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницыНастроекОжидание;
		ПрочитатьНастройкиОрганизации();
		УстановитьДоступностьСписка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПодсказкуВводаОрганизации(Форма, ПриСоздании = Ложь)

	Элементы = Форма.Элементы;
	
	ТекстИнформация = НСтр("ru = 'Пожалуйста, подождите ...'");
	Если ПриСоздании Тогда
		Подсказка = НСтр("ru = 'Укажите структурное подразделение'");
	Иначе	
		Если ТипЗнч(Форма.Организация) = Тип("СправочникСсылка.Организации") Тогда
			Подсказка 		= НСтр("ru = 'Укажите организацию'");
			ТекстИнформация = НСтр("ru = 'Жду указания организации'"); 
		ИначеЕсли ТипЗнч(Форма.Организация) = Тип("СправочникСсылка.Подразделения") Тогда	
			Подсказка 		= НСтр("ru = 'Укажите ЦФО'");
			ТекстИнформация = НСтр("ru = 'Жду указания ЦФО'");
		ИначеЕсли ТипЗнч(Форма.Организация) = Тип("СправочникСсылка.бит_ГруппыСтруктурныхПодразделений") Тогда
			Подсказка = НСтр("ru = 'Укажите группу структурных подразделений'");
			ТекстИнформация = НСтр("ru = 'Жду указания группы структурных подразделений'");
		Иначе
			Подсказка = НСтр("ru = '<Для всего предприятия>'");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Организация.ПодсказкаВвода = Подсказка;
	Элементы.ТекстИнформация.Заголовок   = ТекстИнформация;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьИОписатьНастройкиУчета()
	
	ПрочитатьУчетнуюПолитику();
	УправлениеФормой(ЭтотОбъект, Неопределено);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРаздела(ИмяЭлемента)
	
	ПозицияРазделителя = СтрНайти(ИмяЭлемента, "_");
	Если ПозицияРазделителя = 0 Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось определить имя регистра по имени элемента ""%1""'"),ИмяЭлемента );
	КонецЕсли;
	
	Возврат Сред(ИмяЭлемента, ПозицияРазделителя + 1);
	
КонецФункции

&НаСервере
Процедура ПрочитатьНастройкиОрганизацииНаСервере()

	Если ЗначениеЗаполнено(Организация) ИЛИ Организация = Неопределено Тогда
		Если Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница <> Элементы.ОбщаяСтраницаНастройки Тогда
			УстановитьДоступностьВидимостьНастроек(Истина);
		КонецЕсли;
	КонецЕсли;
	
	РазблокироватьДанныеДляРедактирования(, УникальныйИдентификатор); // Все разблокируем
	Если ПустаяСтрока(РезультатБлокировки) Тогда
		ПодготовитьФормуНастройки();
	КонецЕсли;
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФлагаНастройкаВыбрана(ИмяРаздела)

	Возврат СтрШаблон("%1Выбран", ИмяРаздела);

КонецФункции

&НаСервере
Процедура УдалитьНастройкиНаСервере()
	
	ИменаРегистров = Новый Массив;
	ИменаРегистров.Добавить("бит_НастройкиПрограммыОбщие");
	ИменаРегистров.Добавить("бит_НастройкиБюджетирования");
	ИменаРегистров.Добавить("бит_НастройкиКазначейства");
	ИменаРегистров.Добавить("бит_НастройкиВизирования");
	ИменаРегистров.Добавить("бит_НастройкиДоговоровИЗатрат");
	ИменаРегистров.Добавить("бит_НастройкиЗакупок");
	
	Попытка
		НачатьТранзакцию();
		Для каждого ИмяРегистра Из ИменаРегистров Цикл
			НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СтруктурноеПодразделение.Установить(Организация);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось удалить настройки по причине: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Для каждого КлючЗначение Из КомандыПоПодразделениям Цикл
		Если КлючЗначение.Значение = Организация Тогда
			КнопкаФормы = Элементы.Найти(КлючЗначение.Ключ);
			Если КнопкаФормы <> Неопределено Тогда
				Элементы.Удалить(КнопкаФормы);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Ложь;
	Организация		   = Неопределено;
	ДатаИзменения 	   = ТекущаяДата;
	
	УстановитьДоступностьВидимостьНастроек(Ложь);
	УстановитьПодсказкуВводаОрганизации(ЭтотОбъект, Истина);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
